<?php

namespace Database\Seeders;

use App\Models\Team;
use Illuminate\Database\Seeder;

class TeamSeeder extends Seeder
{
    public function run(): void
    {
        $teams = [
            'ДЦСтанц 2 ТӨХК',
            'ДЦСтанц 3 ТӨХК',
            'ДЦСтанц 4 ТӨХК',
            'ДДЦСтанц ТӨХК',
            'ЭДЦСтанц ТӨХК',
            'Хөвсгөл Дулааны Станц ТӨХК',
            'Даланзадгадын Дулааны Цахилгаан станц ТӨХК',
            'Амгалан Дулааны Станц',
            'Налайх Дулааны Станц',
            'Багануур Дулааны Станц',
            'ЦДҮСүлжээ ТӨХК',
            'УБЦТСүлжээ ТӨХК',
            'ӨБЦТСүлжээ ТӨХК',
            'БНЗӨБЦТСүлжээ ТӨХК',
            'ЭБЦТСүлжээ ТӨХК',
            'АУЦТСүлжээ ТӨХК',
            'ББЦТСүлжээ ТӨХК',
            'УБДСүлжээ ТӨХК',
            'ДДСүлжээ ТӨХК',
            'ЭХҮТөв ТӨХХК',
            'ДҮТөв ТӨХХК',
            'ЭХЗХороо, ЭХЯам',
            'ДСЦТСүлжээ ХК',
            'Бөөрөлжүүтийн цахилгаан станц',
            'Эрчим хүчний зураг төсөл зохиогчдын холбоо',
            'Хасу мегаватт',
            'Ньюком ХХК',
            'Монхорус эрчим ХХК',
            'Тайшир-ногоон эрчим хүч',
            'Баян-Өлгий ЦТС',
        ];

        foreach ($teams as $name) {
            Team::firstOrCreate(['name' => $name]);
        }
    }
}
